---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\gtierney\Google Drive\final version April 2018\data\Overview_Aufbereitet.log
  log type:  text
 opened on:  17 Apr 2018, 13:55:51

. 
. 
. *************************************************************************************************
. * LABEL
. 
. label var date "Datum"

. label var id "Personen ID"

. label var no_problem "problematische Teilnehmernummer"

. label var session_problem "Problematische Sessionnummer"

. label var reason_problem "Grund für Problematik"

. label var treatment_id "eindeutige numerische Identifikation des Treatments"

. label var treatment_id2 "eindeutige Identifikation des Treatments als Character"

. label var slider "Slider Dummy"

. label var creative "Creative Dummy"

. label var eke "EKE Dummy"

. label var kek "KEK Dummy"

. label var slider_fair "Slider mit Fairwage Abfrage Dummy"

. label var creative_trans "Creative Task mit Transfer Dummy"

. label var subject "Teilnehmernummer innerhalb der Session"

. label var proposer "Arbeitgeber (0: Arbeitnehmer, 1: Arbeitgeber)"

. label var score1 "Score nachbewertet Runde 1"

. label var score2 "Score nachbewertet Runde 2"

. label var score3 "Score nachbewertet Runde 3"

. label var effort1 "Leistung Runde 1"

. label var effort2 "Leistung Runde 2"

. label var effort3 "Leistung Runde 3"

. label var bonus_dec "Bonusentscheidung"

. label var transfer1 "Transfer an AG in Runde 1 (kreative transfer Treatments)"

. label var transfer2 "Transfer an AG in Runde 2 (kreative transfer Treatments)"

. label var transfer3 "Transfer an AG in Runde 3 (kreative transfer Treatments)"

. 
. 
. 
. *************************************************************************************************
. * Ausschließen falls Arbeitgeber, keine Bonus Decision, Problemkandidat oder Problemsession
. drop if subject_sample==0
(585 observations deleted)

. 
. * Generieren zusätzlicher Variablen
. 
. replace age=. if age==0
(0 real changes made)

. gen age2=age^2

. label var age2 "Alter quadriert"

. 
. * Überblick über die Anzahl der gültigen Teilnehmer in den jeweiligen Treatments
. tab treatment_id

 eindeutige |
 numerische |
Identifikat |
    ion des |
 Treatments |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |         60        7.89        7.89
         12 |         60        7.89       15.79
         13 |         56        7.37       23.16
         14 |         56        7.37       30.53
         21 |         56        7.37       37.89
         22 |         56        7.37       45.26
         23 |         60        7.89       53.16
         24 |         68        8.95       62.11
         31 |         55        7.24       69.34
         32 |         46        6.05       75.39
         41 |         71        9.34       84.74
         42 |         68        8.95       93.68
         52 |         48        6.32      100.00
------------+-----------------------------------
      Total |        760      100.00

. 
. 
. 
. *************************************************************************************************
. * STANDARDISIERUNGEN
. 
. * Standardisieren der Efforts
. 
. // Standardisierung von effort1, effort2, effort3 der Slidertask Beobachtungen (slidertask effort standardized with mean and sd of slidertask control group)
. 
. sum effort1 if treatment_id==11

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     effort1 |         60    16.58333    12.50666          0         39

. gen zeffort1_sl = (effort1 - r(mean)) / r(sd) if slider==1
(528 missing values generated)

. 
. sum effort2 if treatment_id==11

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     effort2 |         60    19.78333    12.92756          0         44

. gen zeffort2_sl = (effort2 - r(mean)) / r(sd) if slider==1
(528 missing values generated)

. 
. sum effort3 if treatment_id==11

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     effort3 |         60        17.1    12.76741          0         43

. gen zeffort3_sl = (effort3 - r(mean)) / r(sd) if slider==1
(528 missing values generated)

. 
. 
. // Standardisierung von effort1, effort2, effort3 der kreativen Beobachtungen (creative task effort standardized with mean and sd of creative task control group)
. 
. sum effort1 if treatment_id==21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     effort1 |         56    16.78571    11.69104          0         47

. gen zeffort1_cr = (effort1 - r(mean)) / r(sd) if creative==1
(520 missing values generated)

. 
. sum effort2 if treatment_id==21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     effort2 |         56    15.89286    12.08106          0         53

. gen zeffort2_cr = (effort2 - r(mean)) / r(sd) if creative==1
(520 missing values generated)

. 
. sum effort3 if treatment_id==21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     effort3 |         56    15.71429    12.68172          0         59

. gen zeffort3_cr = (effort3 - r(mean)) / r(sd) if creative==1
(520 missing values generated)

. 
. 
. // Standardisierung von effort1, effort2, effort3 der EKE Beobachtungen 
. 
. sum effort1 if treatment_id==11

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     effort1 |         60    16.58333    12.50666          0         39

. gen zeffort1_eke = (effort1 - r(mean)) / r(sd) if eke==1
(705 missing values generated)

. 
. sum effort2 if treatment_id==21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     effort2 |         56    15.89286    12.08106          0         53

. gen zeffort2_eke = (effort2 - r(mean)) / r(sd) if eke==1
(705 missing values generated)

. 
. sum effort3 if treatment_id==11

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     effort3 |         60        17.1    12.76741          0         43

. gen zeffort3_eke = (effort3 - r(mean)) / r(sd) if eke==1
(705 missing values generated)

. 
. 
. // Standardisierung von effort1, effort2, effort3 der KEK Beobachtungen 
. 
. sum effort1 if treatment_id==21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     effort1 |         56    16.78571    11.69104          0         47

. gen zeffort1_kek = (effort1 - r(mean)) / r(sd) if kek==1
(714 missing values generated)

. 
. sum effort2 if treatment_id==11

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     effort2 |         60    19.78333    12.92756          0         44

. gen zeffort2_kek = (effort2 - r(mean)) / r(sd) if kek==1
(714 missing values generated)

. 
. sum effort3 if treatment_id==21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     effort3 |         56    15.71429    12.68172          0         59

. gen zeffort3_kek = (effort3 - r(mean)) / r(sd) if kek==1
(714 missing values generated)

. 
. 
. // Standardisieren von effort1, effort2, effort3 der kreativen Transfer Beobachtungen
. 
. sum effort1 if treatment_id==21                         

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     effort1 |         56    16.78571    11.69104          0         47

. gen zeffort1_cr_trans = (effort1 - r(mean)) / r(sd) if creative_trans==1
(621 missing values generated)

. 
. sum effort2 if treatment_id==21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     effort2 |         56    15.89286    12.08106          0         53

. gen zeffort2_cr_trans = (effort2 - r(mean)) / r(sd) if creative_trans==1
(621 missing values generated)

. 
. sum effort3 if treatment_id==21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     effort3 |         56    15.71429    12.68172          0         59

. gen zeffort3_cr_trans = (effort3 - r(mean)) / r(sd) if creative_trans==1
(621 missing values generated)

. 
. 
. // Standardisieren von effort1, effort2, effort3 der Slider Beobachtungen mit Fairwage Abfrage
. 
. sum effort1 if treatment_id==11                         

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     effort1 |         60    16.58333    12.50666          0         39

. gen zeffort1_sl_fairw = (effort1 - r(mean)) / r(sd) if slider_fair==1
(712 missing values generated)

. 
. sum effort2 if treatment_id==11

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     effort2 |         60    19.78333    12.92756          0         44

. gen zeffort2_sl_fairw = (effort2 - r(mean)) / r(sd) if slider_fair==1
(712 missing values generated)

. 
. sum effort3 if treatment_id==11

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     effort3 |         60        17.1    12.76741          0         43

. gen zeffort3_sl_fairw = (effort3 - r(mean)) / r(sd) if slider_fair==1
(712 missing values generated)

. 
. 
. 
. * Standardisieren der Scores
. 
. // Standardisieren von score1, score2, score3 der Slidertask Beobachtungen & Slidertask Fairwage Beobachtungen
. 
. sum score1 if treatment_id==11

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      score1 |         60    16.58333    12.50666          0         39

. gen zscore1_sl = (score1 - r(mean)) / r(sd) if (slider==1 | slider_fair==1)
(480 missing values generated)

. 
. sum score2 if treatment_id==11

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      score2 |         60    19.78333    12.92756          0         44

. gen zscore2_sl = (score2 - r(mean)) / r(sd) if (slider==1 | slider_fair==1)
(480 missing values generated)

. 
. sum score3 if treatment_id==11

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      score3 |         60        17.1    12.76741          0         43

. gen zscore3_sl = (score3 - r(mean)) / r(sd) if (slider==1 | slider_fair==1)
(480 missing values generated)

. 
. 
. // Standardisieren von score1, score2, score3 der kreativen Beobachtungen
. 
. sum score1 if treatment_id==21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      score1 |         56    16.78571    11.69104          0         47

. gen zscore1_cr = (score1 - r(mean)) / r(sd) if creative==1
(520 missing values generated)

. 
. sum score2 if treatment_id==21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      score2 |         56    15.89286    12.08106          0         53

. gen zscore2_cr = (score2 - r(mean)) / r(sd) if creative==1 
(520 missing values generated)

. 
. sum score3 if treatment_id==21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      score3 |         56    15.71429    12.68172          0         59

. gen zscore3_cr = (score3 - r(mean)) / r(sd) if creative==1
(520 missing values generated)

. 
. 
. // Standardisieren von score1, score2, score3 der kreativen Transfer Beobachtungen
. 
. sum score1 if treatment_id==21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      score1 |         56    16.78571    11.69104          0         47

. gen zscore1_cr_trans = (score1 - r(mean)) / r(sd) if creative_trans==1
(621 missing values generated)

. 
. sum score2 if treatment_id==21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      score2 |         56    15.89286    12.08106          0         53

. gen zscore2_cr_trans = (score2 - r(mean)) / r(sd) if creative_trans==1
(621 missing values generated)

. 
. sum score3 if treatment_id==21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      score3 |         56    15.71429    12.68172          0         59

. gen zscore3_cr_trans = (score3 - r(mean)) / r(sd) if creative_trans==1
(621 missing values generated)

. 
. 
. // Standardisieren von score1, score2, score3 der EKE Beobachtungen
. 
. sum score1 if treatment_id==31

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      score1 |         55    19.50909    13.06235          0         45

. gen zscore1_eke = (score1 - r(mean)) / r(sd) if eke==1
(705 missing values generated)

. 
. sum score2 if treatment_id==31

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      score2 |         55    22.69091    11.90685          0         63

. gen zscore2_eke = (score2 - r(mean)) / r(sd) if eke==1
(705 missing values generated)

. 
. sum score3 if treatment_id==31

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      score3 |         55    21.16364    14.39234          0         45

. gen zscore3_eke = (score3 - r(mean)) / r(sd) if eke==1
(705 missing values generated)

. 
. 
. // Standardisieren von score1, score2, score3 der KEK Beobachtungen
. 
. sum score1 if treatment_id==32

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      score1 |         46    17.84783    10.37726          0         42

. gen zscore1_kek = (score1 - r(mean)) / r(sd) if kek==1
(714 missing values generated)

. 
. sum score2 if treatment_id==32

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      score2 |         46    27.45652    11.43621          0         45

. gen zscore2_kek = (score2 - r(mean)) / r(sd) if kek==1
(714 missing values generated)

. 
. sum score3 if treatment_id==32

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      score3 |         46    17.21739    8.676694          0         46

. gen zscore3_kek = (score3 - r(mean)) / r(sd) if kek==1
(714 missing values generated)

. 
. 
. 
. * Standardisieren der transfers
. 
. // Standardisieren von transfer1, transfer2, transfer3 der Slidertask Beobachtungen & Slidertask Fairwage Beobachtungen
. 
. sum transfer1 if treatment_id==11

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   transfer1 |         60    16.58333    12.50666          0         39

. gen ztransfer1_sl = (transfer1 - r(mean)) / r(sd) if (slider==1 | slider_fair==1)
(480 missing values generated)

. 
. sum transfer2 if treatment_id==11

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   transfer2 |         60    19.78333    12.92756          0         44

. gen ztransfer2_sl = (transfer2 - r(mean)) / r(sd) if (slider==1 | slider_fair==1)
(480 missing values generated)

. 
. sum transfer3 if treatment_id==11

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   transfer3 |         60        17.1    12.76741          0         43

. gen ztransfer3_sl = (transfer3 - r(mean)) / r(sd) if (slider==1 | slider_fair==1)
(480 missing values generated)

. 
. 
. // Standardisieren von transfer1, transfer2, transfer3 der kreativen Beobachtungen
. 
. sum transfer1 if treatment_id==21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   transfer1 |         56    16.78571    11.69104          0         47

. gen ztransfer1_cr = (transfer1 - r(mean)) / r(sd) if creative==1
(520 missing values generated)

. 
. sum transfer2 if treatment_id==21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   transfer2 |         56    15.89286    12.08106          0         53

. gen ztransfer2_cr = (transfer2 - r(mean)) / r(sd) if creative==1
(520 missing values generated)

. 
. sum transfer3 if treatment_id==21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   transfer3 |         56    15.71429    12.68172          0         59

. gen ztransfer3_cr = (transfer3 - r(mean)) / r(sd) if creative==1
(520 missing values generated)

. 
. 
. // Standardisieren von transfer1, transfer2, transfer3 der kreativen Transfer Beobachtungen
. 
. sum transfer1 if treatment_id==21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   transfer1 |         56    16.78571    11.69104          0         47

. gen ztransfer1_cr_trans = (transfer1 - r(mean)) / r(sd) if (creative_trans==1)
(621 missing values generated)

. 
. sum transfer2 if treatment_id==21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   transfer2 |         56    15.89286    12.08106          0         53

. gen ztransfer2_cr_trans = (transfer2 - r(mean)) / r(sd) if (creative_trans==1)
(621 missing values generated)

. 
. sum transfer3 if treatment_id==21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   transfer3 |         56    15.71429    12.68172          0         59

. gen ztransfer3_cr_trans = (transfer3 - r(mean)) / r(sd) if (creative_trans==1)
(621 missing values generated)

. 
. // Standardisieren von transfer1, transfer2, transfer3 der EKE Beobachtungen
. 
. sum transfer1 if treatment_id==11

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   transfer1 |         60    16.58333    12.50666          0         39

. gen ztransfer1_eke = (transfer1 - r(mean)) / r(sd) if eke==1
(705 missing values generated)

. 
. sum transfer2 if treatment_id==21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   transfer2 |         56    15.89286    12.08106          0         53

. gen ztransfer2_eke = (transfer2 - r(mean)) / r(sd) if eke==1
(705 missing values generated)

. 
. sum transfer3 if treatment_id==11

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   transfer3 |         60        17.1    12.76741          0         43

. gen ztransfer3_eke = (transfer3 - r(mean)) / r(sd) if eke==1
(705 missing values generated)

. 
. 
. // Standardisieren von transfer1, transfer2, transfer3 der KEK Beobachtungen
. 
. sum transfer1 if treatment_id==21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   transfer1 |         56    16.78571    11.69104          0         47

. gen ztransfer1_kek = (transfer1 - r(mean)) / r(sd) if kek==1
(714 missing values generated)

. 
. sum transfer2 if treatment_id==11

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   transfer2 |         60    19.78333    12.92756          0         44

. gen ztransfer2_kek = (transfer2 - r(mean)) / r(sd) if kek==1
(714 missing values generated)

. 
. sum transfer3 if treatment_id==21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   transfer3 |         56    15.71429    12.68172          0         59

. gen ztransfer3_kek = (transfer3 - r(mean)) / r(sd) if kek==1
(714 missing values generated)

. 
. 
. 
. * Standardisieren der einzelnen Punktekategorien bei der kreativen Aufgabe
. 
. // Standardisieren von p_valid, p_flex & p_original der kreativen Beobachtungen
. 
. sum p_valid1 if treatment_id==21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    p_valid1 |         56           7    4.809082          0         17

. gen zp_valid1=(p_valid1-r(mean))/r(sd) if creative==1
(520 missing values generated)

. 
. sum p_valid2 if treatment_id==21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    p_valid2 |         56    6.160714    4.479354          0         19

. gen zp_valid2=(p_valid2-r(mean))/r(sd) if creative==1
(520 missing values generated)

. 
. sum p_valid3 if treatment_id==21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    p_valid3 |         56    7.053571    5.606553          0         27

. gen zp_valid3=(p_valid3-r(mean))/r(sd) if creative==1
(520 missing values generated)

. 
. sum p_flex1 if treatment_id==21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     p_flex1 |         56    5.964286    3.692569          0         14

. gen zp_flex1=(p_flex1-r(mean))/r(sd) if creative==1
(520 missing values generated)

. 
. sum p_flex2 if treatment_id==21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     p_flex2 |         56    6.142857    4.295573          0         19

. gen zp_flex2=(p_flex2-r(mean))/r(sd) if creative==1
(520 missing values generated)

. 
. sum p_flex3 if treatment_id==21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     p_flex3 |         56    5.767857    4.076501          0         16

. gen zp_flex3=(p_flex3-r(mean))/r(sd) if creative==1
(520 missing values generated)

. 
. sum p_original1 if treatment_id==21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 p_original1 |         56    3.821429    3.747033          0         16

. gen zp_original1=(p_original1-r(mean))/r(sd) if creative==1
(520 missing values generated)

. 
. sum p_original2 if treatment_id==21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 p_original2 |         56    3.589286    3.869587          0         15

. gen zp_original2=(p_original2-r(mean))/r(sd) if creative==1
(520 missing values generated)

. 
. sum p_original3 if treatment_id==21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 p_original3 |         56    2.892857    3.467661          0         16

. gen zp_original3=(p_original3-r(mean))/r(sd) if creative==1
(520 missing values generated)

. 
. 
. // Standardisieren von p_valid, p_flex & p_original der kreativen Transfer Beobachtungen
. 
. sum p_valid1 if treatment_id==41

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    p_valid1 |         71    8.338028    4.887137          0         23

. gen zp_valid1_trans=(p_valid1-r(mean))/r(sd) if creative_trans==1
(621 missing values generated)

. 
. sum p_valid2 if treatment_id==41

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    p_valid2 |         71    7.549296    4.302122          0         19

. gen zp_valid2_trans=(p_valid2-r(mean))/r(sd) if creative_trans==1
(621 missing values generated)

. 
. sum p_valid3 if treatment_id==41

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    p_valid3 |         71    7.971831    4.656706          0         17

. gen zp_valid3_trans=(p_valid3-r(mean))/r(sd) if creative_trans==1
(621 missing values generated)

. 
. sum p_flex1 if treatment_id==41

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     p_flex1 |         71    7.014085    3.579677          0         14

. gen zp_flex1_trans=(p_flex1-r(mean))/r(sd) if creative_trans==1
(621 missing values generated)

. 
. sum p_flex2 if treatment_id==41

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     p_flex2 |         71    7.380282    3.907378          0         17

. gen zp_flex2_trans=(p_flex2-r(mean))/r(sd) if creative_trans==1
(621 missing values generated)

. 
. sum p_flex3 if treatment_id==41

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     p_flex3 |         71    6.647887      3.5055          0         15

. gen zp_flex3_trans=(p_flex3-r(mean))/r(sd) if creative_trans==1
(621 missing values generated)

. 
. sum p_original1 if treatment_id==41

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 p_original1 |         71    4.450704      3.9453          0         15

. gen zp_original1_trans=(p_original1-r(mean))/r(sd) if creative_trans==1
(621 missing values generated)

. 
. sum p_original2 if treatment_id==41

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 p_original2 |         71    4.464789    3.540908          0         14

. gen zp_original2_trans=(p_original2-r(mean))/r(sd) if creative_trans==1
(621 missing values generated)

. 
. sum p_original3 if treatment_id==41

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 p_original3 |         71    3.816901    2.919442          0         11

. gen zp_original3_trans=(p_original3-r(mean))/r(sd) if creative_trans==1
(621 missing values generated)

. 
. /*
> sum originality_points_sum_1_10 if treatment_id==21
> gen zp_original1_10=(originality_points_sum_1_10-r(mean))/r(sd) if creative==1
> sum originality_points_sum_1_5 if treatment_id==21
> gen zp_original1_5=(originality_points_sum_1_5-r(mean))/r(sd) if creative==1
> sum originality_points_sum_1_1 if treatment_id==21
> gen zp_original1_1=(originality_points_sum_1_1-r(mean))/r(sd) if creative==1
> 
> 
> sum originality_points_sum_2_10 if treatment_id==21
> gen zp_original2_10=(originality_points_sum_2_10-r(mean))/r(sd) if creative==1
> sum originality_points_sum_2_5 if treatment_id==21
> gen zp_original2_5=(originality_points_sum_2_5-r(mean))/r(sd) if creative==1
> sum originality_points_sum_2_1 if treatment_id==21
> gen zp_original2_1=(originality_points_sum_2_1-r(mean))/r(sd) if creative==1
> */
. 
. 
. 
. 
. 
. 
. *************************************************************************************************
. * DIFFERENZENBERECHNUNG
. 
. * Differenzen berechnen der Efforts je nach Treatment
. 
. gen diff1 = effort2-effort1

. gen diff2 = effort3-effort2

. gen diff3 = effort3-effort1

. label var diff1 `"effort2 - effort1"'

. label var diff2 `"effort3 - effort2"'

. label var diff3 `"effort3 - effort1"'

. 
. gen zdiff1_sl = zeffort2_sl-zeffort1_sl
(528 missing values generated)

. gen zdiff2_sl = zeffort3_sl-zeffort2_sl
(528 missing values generated)

. gen zdiff3_sl = zeffort3_sl-zeffort1_sl
(528 missing values generated)

. label var zdiff1_sl `"zeffort2_sl - zeffort1_sl"'

. label var zdiff2_sl `"zeffort3_sl - zeffort2_sl"'

. label var zdiff3_sl `"zeffort3_sl - zeffort1_sl"'

. 
. gen zdiff1_cr = zeffort2_cr-zeffort1_cr
(520 missing values generated)

. gen zdiff2_cr = zeffort3_cr-zeffort2_cr
(520 missing values generated)

. gen zdiff3_cr = zeffort3_cr-zeffort1_cr
(520 missing values generated)

. label var zdiff1_cr `"zeffort2_cr - zeffort1_cr"'

. label var zdiff2_cr `"zeffort3_cr - zeffort2_cr"'

. label var zdiff3_cr `"zeffort3_cr - zeffort1_cr"'

. 
. gen zdiff1_eke = zeffort2_eke-zeffort1_eke
(705 missing values generated)

. gen zdiff2_eke = zeffort3_eke-zeffort2_eke
(705 missing values generated)

. gen zdiff3_eke = zeffort3_eke-zeffort1_eke
(705 missing values generated)

. label var zdiff1_eke `"zeffort2_eke - zeffort1_eke"'

. label var zdiff2_eke `"zeffort3_eke - zeffort2_eke"'

. label var zdiff3_eke `"zeffort3_eke - zeffort1_eke"'

. 
. gen zdiff1_kek = zeffort2_kek-zeffort1_kek
(714 missing values generated)

. gen zdiff2_kek = zeffort3_kek-zeffort2_kek
(714 missing values generated)

. gen zdiff3_kek = zeffort3_kek-zeffort1_kek
(714 missing values generated)

. label var zdiff1_kek `"zeffort2_kek - zeffort1_kek"'

. label var zdiff2_kek `"zeffort3_kek - zeffort2_kek"'

. label var zdiff3_kek `"zeffort3_kek - zeffort1_kek"'

. 
. gen zdiff1_cr_trans = zeffort2_cr_trans-zeffort1_cr_trans
(621 missing values generated)

. gen zdiff2_cr_trans = zeffort3_cr_trans-zeffort2_cr_trans
(621 missing values generated)

. gen zdiff3_cr_trans = zeffort3_cr_trans-zeffort1_cr_trans
(621 missing values generated)

. label var zdiff1_cr_trans `"zeffort2_cr_trans - zeffort1_cr_trans"'

. label var zdiff2_cr_trans `"zeffort3_cr_trans - zeffort2_cr_trans"'

. label var zdiff3_cr_trans `"zeffort3_cr_trans - zeffort1_cr_trans"'

. 
. 
. 
. * Differenzen berechnen für einzelne Punktkategorien bei der kreativen Aufgabe
. 
. gen diff1_valid = p_valid2 - p_valid1
(381 missing values generated)

. gen diff2_valid = p_valid3 - p_valid2
(381 missing values generated)

. gen diff3_valid = p_valid3 - p_valid1
(335 missing values generated)

. label var diff1_valid `"p_valid2 - p_valid1"'

. label var diff2_valid `"p_valid3 - p_valid2"'

. label var diff3_valid `"p_valid3 - p_valid1"'

. 
. gen diff1_flex = p_flex2 - p_flex1
(381 missing values generated)

. gen diff2_flex = p_flex3 - p_flex2
(381 missing values generated)

. gen diff3_flex = p_flex3 - p_flex1
(335 missing values generated)

. label var diff1_flex `"p_flex2 - p_flex1"'

. label var diff2_flex `"p_flex3 - p_flex2"'

. label var diff3_flex `"p_flex3 - p_flex1"'

. 
. gen diff1_original = p_original2 - p_original1
(381 missing values generated)

. gen diff2_original = p_original3 - p_original2
(381 missing values generated)

. gen diff3_original = p_original3 - p_original1
(335 missing values generated)

. label var diff1_original `"p_original2 - p_original1"'

. label var diff2_original `"p_original3 - p_original2"'

. label var diff3_original `"p_original3 - p_original1"'

. 
. 
. 
. * Einheitliche Variable für standardisierte effort1-3, score1-3 und transfer1-3
. 
. gen zeffort1 = .
(760 missing values generated)

. 
. replace zeffort1 = zeffort1_sl if slider==1
(232 real changes made)

. replace zeffort1 = zeffort1_cr if creative==1
(240 real changes made)

. replace zeffort1 = zeffort1_eke if eke==1
(55 real changes made)

. replace zeffort1 = zeffort1_kek if kek==1
(46 real changes made)

. replace zeffort1 = zeffort1_cr_trans if creative_trans==1
(139 real changes made)

. replace zeffort1 = zeffort1_sl_fairw if slider_fair==1
(48 real changes made)

. 
. gen zeffort2 = .
(760 missing values generated)

. 
. replace zeffort2 = zeffort2_sl if slider==1
(232 real changes made)

. replace zeffort2 = zeffort2_cr if creative==1
(240 real changes made)

. replace zeffort2 = zeffort2_eke if eke==1
(55 real changes made)

. replace zeffort2 = zeffort2_kek if kek==1
(46 real changes made)

. replace zeffort2 = zeffort2_cr_trans if creative_trans==1
(139 real changes made)

. replace zeffort2 = zeffort2_sl_fairw if slider_fair==1
(48 real changes made)

. 
. gen zeffort3 = .
(760 missing values generated)

. 
. replace zeffort3 = zeffort3_sl if slider==1
(232 real changes made)

. replace zeffort3 = zeffort3_cr if creative==1
(240 real changes made)

. replace zeffort3 = zeffort3_eke if eke==1
(55 real changes made)

. replace zeffort3 = zeffort3_kek if kek==1
(46 real changes made)

. replace zeffort3 = zeffort3_cr_trans if creative_trans==1
(139 real changes made)

. replace zeffort3 = zeffort3_sl_fairw if slider_fair==1
(48 real changes made)

. 
. 
. 
. gen zscore1 = .
(760 missing values generated)

. replace zscore1 = zscore1_sl if (slider==1 | slider_fair==1)
(280 real changes made)

. replace zscore1 = zscore1_cr if creative==1
(240 real changes made)

. replace zscore1 = zscore1_cr_trans if creative_trans==1
(139 real changes made)

. replace zscore1 = zscore1_eke if eke==1
(55 real changes made)

. replace zscore1 = zscore1_kek if kek==1
(46 real changes made)

. 
. gen zscore2 = .
(760 missing values generated)

. replace zscore2 = zscore2_sl if (slider==1 | slider_fair==1)
(280 real changes made)

. replace zscore2 = zscore2_cr if creative==1
(240 real changes made)

. replace zscore2 = zscore2_cr_trans if creative_trans==1
(139 real changes made)

. replace zscore2 = zscore2_eke if eke==1
(55 real changes made)

. replace zscore2 = zscore2_kek if kek==1
(46 real changes made)

. 
. gen zscore3 = .
(760 missing values generated)

. replace zscore3 = zscore3_sl if (slider==1 | slider_fair==1)
(280 real changes made)

. replace zscore3 = zscore3_cr if creative==1
(240 real changes made)

. replace zscore3 = zscore3_cr_trans if creative_trans==1
(139 real changes made)

. replace zscore3 = zscore3_eke if eke==1
(55 real changes made)

. replace zscore3 = zscore3_kek if kek==1
(46 real changes made)

. 
. 
. 
. gen ztransfer1 = .
(760 missing values generated)

. replace ztransfer1 = ztransfer1_sl if (slider==1 | slider_fair==1)
(280 real changes made)

. replace ztransfer1 = ztransfer1_cr if creative==1 
(240 real changes made)

. replace ztransfer1 = ztransfer1_cr_trans if creative_trans==1
(139 real changes made)

. replace ztransfer1 = ztransfer1_eke if eke==1
(55 real changes made)

. replace ztransfer1 = ztransfer1_kek if kek==1
(46 real changes made)

. 
. gen ztransfer2 = .
(760 missing values generated)

. replace ztransfer2 = ztransfer2_sl if (slider==1 | slider_fair==1)
(280 real changes made)

. replace ztransfer2 = ztransfer2_cr if creative==1
(240 real changes made)

. replace ztransfer2 = ztransfer2_cr_trans if creative_trans==1
(139 real changes made)

. replace ztransfer2 = ztransfer2_eke if eke==1
(55 real changes made)

. replace ztransfer2 = ztransfer2_kek if kek==1
(46 real changes made)

. 
. gen ztransfer3 = .
(760 missing values generated)

. replace ztransfer3 = ztransfer3_sl if (slider==1 | slider_fair==1)
(280 real changes made)

. replace ztransfer3 = ztransfer3_cr if creative==1
(240 real changes made)

. replace ztransfer3 = ztransfer3_cr_trans if creative_trans==1
(139 real changes made)

. replace ztransfer3 = ztransfer3_eke if eke==1
(55 real changes made)

. replace ztransfer3 = ztransfer3_kek if kek==1
(46 real changes made)

. 
. 
. 
. gen zdiff1 = zeffort2 - zeffort1

. gen zdiff2 = zeffort3 - zeffort2

. gen zdiff3 = zeffort3 - zeffort1

. label var zdiff1 `"zeffort2 - zeffort1"'

. label var zdiff2 `"zeffort3 - zeffort2"'

. label var zdiff3 `"zeffort3 - zeffort1"'

. 
. gen zdiffscore1 = zscore2 - zscore1

. gen zdiffscore2 = zscore3 - zscore2

. gen zdiffscore3 = zscore3 - zscore1

. label var zdiffscore1 `"zscore2 - zscore1"'

. label var zdiffscore2 `"zscore3 - zscore2"'

. label var zdiffscore3 `"zscore3 - zscore1"'

. 
. gen zdifftransfer1 = ztransfer2 - ztransfer1

. gen zdifftransfer2 = ztransfer3 - ztransfer2

. gen zdifftransfer3 = ztransfer3 - ztransfer1

. label var zdifftransfer1 `"ztransfer2 - ztransfer1"'

. label var zdifftransfer2 `"ztransfer3 - ztransfer2"'

. label var zdifftransfer3 `"ztransfer3 - ztransfer1"'

. 
. 
. *************************************************************************************************
. * INTERAKTIONSTERME
. 
. gen giftXslid      = gift*slider

. gen turnXslid      = turnier*slider

. gen feedXslid      = feedback*slider

. gen zeffort1Xslid  = zeffort1*slider

. gen zscore1Xslid  = zeffort1*slider

. gen ztransfer1Xslid  = zeffort1*slider

. gen giftXtransfer  = gift_transfer*creative_trans

. 
. gen max_trans      = 0

. replace max_trans  = 1 if (transfer1==effort1)
(713 real changes made)

. 
. * Übersicht Mean Efforts differenziert nach Max_Trans
. sum effort1 if (gift_transfer==1 & max_trans==0)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     effort1 |         29    23.17241    9.223684          5         42

. sum effort1 if (gift_transfer==1 & max_trans==1)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     effort1 |         39    19.46154    11.79618          0         50

. sum effort2 if (gift_transfer==1 & max_trans==0)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     effort2 |         29    20.72414    8.939865          0         35

. sum effort2 if (gift_transfer==1 & max_trans==1)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     effort2 |         39    21.82051    9.346747          0         43

. sum effort3 if (gift_transfer==1 & max_trans==0)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     effort3 |         29    24.17241    8.146292          5         39

. sum effort3 if (gift_transfer==1 & max_trans==1)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     effort3 |         39    21.46154    10.99485          0         45

. 
. gen gift_transXmax_trans = gift_transfer*max_trans

. 
. 
. gen invalid1 = answers1-p_valid1
(335 missing values generated)

. gen invalid2 = answers2-p_valid2
(326 missing values generated)

. 
. 
. sum invalid1 if treatment_id==21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    invalid1 |         56    .9464286    1.241987          0          5

. gen zinvalid1 = (invalid1 - r(mean)) / r(sd) if creative==1
(520 missing values generated)

. 
. sum invalid2 if treatment_id==21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    invalid2 |         56    .7857143    1.090693          0          4

. gen zinvalid2 = (invalid2 - r(mean)) / r(sd) if creative==1
(520 missing values generated)

. 
. 
. 
. *************************************************************************************************
. * REGRESSIONEN
. 
. *Referee
. eststo: quietly reg zinvalid2 zinvalid1 gift turnier if treatment_id>20 & treatment_id<24, r
(est1 stored)

. eststo: quietly reg zp_valid2 zp_valid1 gift turnier if treatment_id>20 & treatment_id<24, r
(est2 stored)

. eststo: quietly reg zp_flex2 zp_flex1 gift turnier if treatment_id>20 & treatment_id<24, r
(est3 stored)

. *eststo: quietly reg zp_original2_10 zp_original1_10 gift turnier if treatment_id>20 & treatment_id<24, r
. *eststo: quietly reg zp_original2_5 zp_original1_5 gift turnier if treatment_id>20 & treatment_id<24, r
. *eststo: quietly reg zp_original2_1 zp_original1_1 gift turnier if treatment_id>20 & treatment_id<24, r
. 
. eststo clear

. 
. 
. 
. 
. * Sample Slider Task
. reg zeffort2 zeffort1 gift turnier feedback if slider==1, robust

Linear regression                               Number of obs     =        232
                                                F(4, 227)         =     100.99
                                                Prob > F          =     0.0000
                                                R-squared         =     0.6363
                                                Root MSE          =     .62082

------------------------------------------------------------------------------
             |               Robust
    zeffort2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    zeffort1 |   .7274376   .0476647    15.26   0.000     .6335158    .8213594
        gift |   .2230212   .1089268     2.05   0.042     .0083843    .4376581
     turnier |   .6496465   .1322074     4.91   0.000     .3891359    .9101571
    feedback |   .1647029    .112455     1.46   0.144    -.0568862    .3862921
       _cons |   1.47e-09   .0807693     0.00   1.000    -.1591534    .1591534
------------------------------------------------------------------------------

. reg zeffort3 zeffort1 gift turnier feedback if slider==1, robust

Linear regression                               Number of obs     =        232
                                                F(4, 227)         =     221.88
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7073
                                                Root MSE          =     .63223

------------------------------------------------------------------------------
             |               Robust
    zeffort3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    zeffort1 |   .9337893   .0393693    23.72   0.000     .8562134    1.011365
        gift |    .260303    .103422     2.52   0.013     .0565131    .4640929
     turnier |   .2253296   .1298291     1.74   0.084    -.0304947    .4811538
    feedback |   .0891751   .1181452     0.75   0.451    -.1436264    .3219765
       _cons |   1.87e-09   .0735593     0.00   1.000    -.1449464    .1449464
------------------------------------------------------------------------------

. 
. 
. 
. * Sample Creative Task All
. reg zeffort2 zeffort1 gift gift_transfer turnier feedback if (creative==1 | creative_trans==1), robust

Linear regression                               Number of obs     =        379
                                                F(5, 373)         =      48.79
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4542
                                                Root MSE          =     .70634

-------------------------------------------------------------------------------
              |               Robust
     zeffort2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     zeffort1 |   .6226846   .0488009    12.76   0.000     .5267252    .7186441
         gift |  -.0758221   .0995679    -0.76   0.447    -.2716069    .1199626
gift_transfer |   .1257382   .0989663     1.27   0.205    -.0688636    .3203399
      turnier |   .6400195   .1409404     4.54   0.000     .3628821    .9171568
     feedback |   .0795507   .0942564     0.84   0.399    -.1057898    .2648912
        _cons |   .0994063   .0623646     1.59   0.112     -.023224    .2220365
-------------------------------------------------------------------------------

. reg zeffort3 zeffort1 gift gift_transfer turnier feedback if (creative==1 | creative_trans==1), robust

Linear regression                               Number of obs     =        379
                                                F(5, 373)         =      69.82
                                                Prob > F          =     0.0000
                                                R-squared         =     0.5178
                                                Root MSE          =     .59858

-------------------------------------------------------------------------------
              |               Robust
     zeffort3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     zeffort1 |   .6194814   .0367636    16.85   0.000     .5471914    .6917713
         gift |  -.0246605   .0867972    -0.28   0.776    -.1953336    .1460127
gift_transfer |   .2669617    .088569     3.01   0.003     .0928045    .4411189
      turnier |   .3016509   .1009779     2.99   0.003     .1030936    .5002083
     feedback |   .0293926    .091522     0.32   0.748    -.1505711    .2093563
        _cons |   .0517507   .0603702     0.86   0.392    -.0669578    .1704593
-------------------------------------------------------------------------------

. reg ztransfer2 ztransfer1 gift gift_transfer turnier feedback if (creative==1 | creative_trans==1), robust

Linear regression                               Number of obs     =        379
                                                F(5, 373)         =      62.02
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4827
                                                Root MSE          =      .7071

-------------------------------------------------------------------------------
              |               Robust
   ztransfer2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
   ztransfer1 |   .6561482   .0456623    14.37   0.000     .5663604     .745936
         gift |  -.0244899   .0977851    -0.25   0.802    -.2167692    .1677893
gift_transfer |   .2722367   .0987754     2.76   0.006     .0780102    .4664631
      turnier |    .686053   .1416191     4.84   0.000      .407581    .9645249
     feedback |   .1253597     .09418     1.33   0.184    -.0598307      .31055
        _cons |   .0503741   .0617103     0.82   0.415    -.0709695    .1717177
-------------------------------------------------------------------------------

. reg ztransfer3 ztransfer1 gift gift_transfer turnier feedback if (creative==1 | creative_trans==1), robust

Linear regression                               Number of obs     =        379
                                                F(5, 373)         =      73.95
                                                Prob > F          =     0.0000
                                                R-squared         =     0.5200
                                                Root MSE          =     .60306

-------------------------------------------------------------------------------
              |               Robust
   ztransfer3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
   ztransfer1 |    .635467   .0378718    16.78   0.000     .5609979     .709936
         gift |   .0439619   .0862538     0.51   0.611    -.1256427    .2135665
gift_transfer |   .2869884    .090031     3.19   0.002     .1099565    .4640203
      turnier |   .3677421   .1014017     3.63   0.000     .1683516    .5671327
     feedback |   .0953765   .0910859     1.05   0.296    -.0837296    .2744827
        _cons |  -.0157729   .0596382    -0.26   0.792    -.1330421    .1014963
-------------------------------------------------------------------------------

. 
. * Sample Creative Task All, getrennt nach maximalem Transfer in Runde1 
. reg zeffort2 zeffort1 gift_transfer if ((creative==1 | creative_trans==1) & max_trans==0), robust

Linear regression                               Number of obs     =         47
                                                F(2, 44)          =       5.07
                                                Prob > F          =     0.0104
                                                R-squared         =     0.2776
                                                Root MSE          =     .69116

-------------------------------------------------------------------------------
              |               Robust
     zeffort2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     zeffort1 |   .4412984   .1607881     2.74   0.009     .1172512    .7653455
gift_transfer |   .0581797   .2115574     0.28   0.785    -.3681862    .4845455
        _cons |    .100649      .1512     0.67   0.509    -.2040745    .4053724
-------------------------------------------------------------------------------

. reg zeffort3 zeffort1 gift_transfer if ((creative==1 | creative_trans==1) & max_trans==0), robust

Linear regression                               Number of obs     =         47
                                                F(2, 44)          =      21.56
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4408
                                                Root MSE          =     .56775

-------------------------------------------------------------------------------
              |               Robust
     zeffort3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     zeffort1 |   .4839245   .0780947     6.20   0.000      .326535    .6413139
gift_transfer |   .4075107   .1841697     2.21   0.032      .036341    .7786804
        _cons |  -.0049193   .1673321    -0.03   0.977    -.3421549    .3323163
-------------------------------------------------------------------------------

. reg zeffort2 zeffort1 gift_transfer if ((creative==1 | creative_trans==1) & max_trans==1), robust

Linear regression                               Number of obs     =        332
                                                F(2, 329)         =      85.36
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4190
                                                Root MSE          =     .74181

-------------------------------------------------------------------------------
              |               Robust
     zeffort2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     zeffort1 |   .6626182   .0512316    12.93   0.000     .5618354     .763401
gift_transfer |   .1002963   .1024573     0.98   0.328    -.1012577    .3018504
        _cons |   .2387019   .0443257     5.39   0.000     .1515043    .3258994
-------------------------------------------------------------------------------

. reg zeffort3 zeffort1 gift_transfer if ((creative==1 | creative_trans==1) & max_trans==1), robust

Linear regression                               Number of obs     =        332
                                                F(2, 329)         =     131.78
                                                Prob > F          =     0.0000
                                                R-squared         =     0.5063
                                                Root MSE          =     .60929

-------------------------------------------------------------------------------
              |               Robust
     zeffort3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     zeffort1 |   .6453687   .0405715    15.91   0.000     .5655565    .7251809
gift_transfer |    .182854   .0962605     1.90   0.058    -.0065098    .3722178
        _cons |   .1226272   .0358321     3.42   0.001     .0521382    .1931161
-------------------------------------------------------------------------------

. 
. reg zeffort2 zeffort1 max_trans gift_transfer gift_transXmax_trans if (creative==1 | creative_trans==1), robust

Linear regression                               Number of obs     =        379
                                                F(4, 374)         =      44.07
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4022
                                                Root MSE          =     .73827

--------------------------------------------------------------------------------------
                     |               Robust
            zeffort2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
            zeffort1 |   .6352608   .0499988    12.71   0.000     .5369468    .7335748
           max_trans |   .2633128   .1913972     1.38   0.170    -.1130367    .6396623
       gift_transfer |   .0755967   .2221781     0.34   0.734     -.361278    .5124715
gift_transXmax_trans |   .0290781   .2428544     0.12   0.905    -.4484532    .5066093
               _cons |  -.0227278   .1851655    -0.12   0.902    -.3868239    .3413682
--------------------------------------------------------------------------------------

. reg zeffort3 zeffort1 max_trans gift_transfer gift_transXmax_trans if (creative==1 | creative_trans==1), robust

Linear regression                               Number of obs     =        379
                                                F(4, 374)         =      79.89
                                                Prob > F          =     0.0000
                                                R-squared         =     0.5047
                                                Root MSE          =     .60583

--------------------------------------------------------------------------------------
                     |               Robust
            zeffort3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
            zeffort1 |   .6254125   .0373246    16.76   0.000     .5520201     .698805
           max_trans |   .2189187    .169528     1.29   0.197    -.1144289    .5522663
       gift_transfer |   .4202157   .1864211     2.25   0.025     .0536508    .7867806
gift_transXmax_trans |  -.2341678   .2098866    -1.12   0.265    -.6468736     .178538
               _cons |  -.0949178   .1654728    -0.57   0.567    -.4202915    .2304558
--------------------------------------------------------------------------------------

. 
. 
. 
. * Sample Creative Transfer Treatments
. reg zeffort2 zeffort1 gift_transfer if creative_trans==1, robust

Linear regression                               Number of obs     =        139
                                                F(2, 136)         =      30.92
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4300
                                                Root MSE          =     .66982

-------------------------------------------------------------------------------
              |               Robust
     zeffort2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     zeffort1 |   .5898073   .0786672     7.50   0.000     .4342381    .7453764
gift_transfer |   .0484079   .1138092     0.43   0.671    -.1766567    .2734725
        _cons |    .188712   .0812914     2.32   0.022     .0279534    .3494706
-------------------------------------------------------------------------------

. reg zeffort3 zeffort1 gift_transfer if creative_trans==1, robust

Linear regression                               Number of obs     =        139
                                                F(2, 136)         =      51.61
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4618
                                                Root MSE          =     .60072

-------------------------------------------------------------------------------
              |               Robust
     zeffort3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     zeffort1 |   .5507316   .0551243     9.99   0.000       .44172    .6597433
gift_transfer |   .2283914   .1013535     2.25   0.026     .0279587    .4288241
        _cons |   .1153628   .0823332     1.40   0.163    -.0474561    .2781817
-------------------------------------------------------------------------------

. reg ztransfer2 ztransfer1 gift_transfer if creative_trans==1, robust

Linear regression                               Number of obs     =        139
                                                F(2, 136)         =      69.05
                                                Prob > F          =     0.0000
                                                R-squared         =     0.5151
                                                Root MSE          =     .67578

-------------------------------------------------------------------------------
              |               Robust
   ztransfer2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
   ztransfer1 |   .6861949   .0664939    10.32   0.000     .5546991    .8176907
gift_transfer |   .2387375   .1095495     2.18   0.031     .0220968    .4553782
        _cons |   .0882737   .0803998     1.10   0.274    -.0707217    .2472692
-------------------------------------------------------------------------------

. reg ztransfer3 ztransfer1 gift_transfer if creative_trans==1, robust

Linear regression                               Number of obs     =        139
                                                F(2, 136)         =      72.83
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4969
                                                Root MSE          =     .61832

-------------------------------------------------------------------------------
              |               Robust
   ztransfer3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
   ztransfer1 |   .6011876    .056728    10.60   0.000     .4890046    .7133706
gift_transfer |   .2923184   .1009913     2.89   0.004      .092602    .4920349
        _cons |  -.0261233   .0768732    -0.34   0.735    -.1781446    .1258981
-------------------------------------------------------------------------------

. 
. * Sample Creative Transfer Treatments, getrennt nach maximalem Transfer in Runde1 
. reg zeffort2 zeffort1 gift_transfer if (creative_trans==1 & max_trans==0), robust

Linear regression                               Number of obs     =         47
                                                F(2, 44)          =       5.07
                                                Prob > F          =     0.0104
                                                R-squared         =     0.2776
                                                Root MSE          =     .69116

-------------------------------------------------------------------------------
              |               Robust
     zeffort2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     zeffort1 |   .4412984   .1607881     2.74   0.009     .1172512    .7653455
gift_transfer |   .0581797   .2115574     0.28   0.785    -.3681862    .4845455
        _cons |    .100649      .1512     0.67   0.509    -.2040745    .4053724
-------------------------------------------------------------------------------

. reg zeffort3 zeffort1 gift_transfer if (creative_trans==1 & max_trans==0), robust

Linear regression                               Number of obs     =         47
                                                F(2, 44)          =      21.56
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4408
                                                Root MSE          =     .56775

-------------------------------------------------------------------------------
              |               Robust
     zeffort3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     zeffort1 |   .4839245   .0780947     6.20   0.000      .326535    .6413139
gift_transfer |   .4075107   .1841697     2.21   0.032      .036341    .7786804
        _cons |  -.0049193   .1673321    -0.03   0.977    -.3421549    .3323163
-------------------------------------------------------------------------------

. reg zeffort2 zeffort1 gift_transfer if (creative_trans==1 & max_trans==1), robust

Linear regression                               Number of obs     =         92
                                                F(2, 89)          =      44.81
                                                Prob > F          =     0.0000
                                                R-squared         =     0.5371
                                                Root MSE          =     .63658

-------------------------------------------------------------------------------
              |               Robust
     zeffort2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     zeffort1 |   .6934548   .0732867     9.46   0.000     .5478357    .8390738
gift_transfer |   .1048834   .1317751     0.80   0.428    -.1569509    .3667178
        _cons |    .227057   .0919721     2.47   0.015     .0443105    .4098035
-------------------------------------------------------------------------------

. reg zeffort3 zeffort1 gift_transfer if (creative_trans==1 & max_trans==1), robust

Linear regression                               Number of obs     =         92
                                                F(2, 89)          =      37.06
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4785
                                                Root MSE          =     .61701

-------------------------------------------------------------------------------
              |               Robust
     zeffort3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     zeffort1 |   .5941966   .0690219     8.61   0.000     .4570515    .7313416
gift_transfer |   .1564636   .1273807     1.23   0.223    -.0966391    .4095663
        _cons |   .1607298   .0938396     1.71   0.090    -.0257275     .347187
-------------------------------------------------------------------------------

. 
. reg zeffort2 zeffort1 max_trans gift_transfer gift_transXmax_trans if creative_trans==1, robust

Linear regression                               Number of obs     =        139
                                                F(4, 134)         =      21.30
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4501
                                                Root MSE          =      .6628

--------------------------------------------------------------------------------------
                     |               Robust
            zeffort2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
            zeffort1 |   .6117494   .0753713     8.12   0.000     .4626781    .7608207
           max_trans |   .2534692   .2029039     1.25   0.214    -.1478394    .6547778
       gift_transfer |   .0734855    .221012     0.33   0.740    -.3636377    .5106086
gift_transXmax_trans |   .0314588   .2573167     0.12   0.903    -.4774688    .5403864
               _cons |  -.0077725   .1733626    -0.04   0.964    -.3506536    .3351085
--------------------------------------------------------------------------------------

. reg zeffort3 zeffort1 max_trans gift_transfer gift_transXmax_trans if creative_trans==1, robust

Linear regression                               Number of obs     =        139
                                                F(4, 134)         =      28.25
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4691
                                                Root MSE          =     .60103

--------------------------------------------------------------------------------------
                     |               Robust
            zeffort3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
            zeffort1 |   .5584655   .0541422    10.31   0.000     .4513817    .6655493
           max_trans |    .221215   .1835419     1.21   0.230    -.1417989    .5842288
       gift_transfer |   .4142041   .1839303     2.25   0.026     .0504222    .7779861
gift_transXmax_trans |  -.2577139   .2237623    -1.15   0.251    -.7002767    .1848489
               _cons |  -.0523338    .163999    -0.32   0.750    -.3766951    .2720276
--------------------------------------------------------------------------------------

. 
. 
. 
. * Sample All (Slider, Slider Fairwage, Creative Task & Creative Transfer Task)
. 
. 
. reg zeffort2 zeffort1 gift turnier feedback creative_trans slider_fair zeffort1Xslid giftXslid turnXslid feedXslid giftXtransfer if (slider==1 | creative==1 | creative_trans==
> 1 | slider_fair==1), robust

Linear regression                               Number of obs     =        659
                                                F(11, 647)        =      79.66
                                                Prob > F          =     0.0000
                                                R-squared         =     0.5414
                                                Root MSE          =     .66965

--------------------------------------------------------------------------------
               |               Robust
      zeffort2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
      zeffort1 |   .6443778   .0444086    14.51   0.000     .5571754    .7315803
          gift |   .0250752   .0978761     0.26   0.798    -.1671181    .2172684
       turnier |   .7374818   .1414507     5.21   0.000     .4597239     1.01524
      feedback |   .1768675   .0935279     1.89   0.059    -.0067873    .3605223
creative_trans |   .1706187   .1046788     1.63   0.104    -.0349325    .3761698
   slider_fair |   .2521097   .1076463     2.34   0.019     .0407314    .4634881
 zeffort1Xslid |   .0830598    .065087     1.28   0.202    -.0447474     .210867
     giftXslid |    .197946   .1064449     1.86   0.063    -.0110731    .4069652
     turnXslid |  -.0878353   .1659604    -0.53   0.597    -.4137214    .2380508
     feedXslid |  -.0121646   .1063993    -0.11   0.909    -.2210942    .1967651
 giftXtransfer |   .0466241   .1136333     0.41   0.682    -.1765105    .2697588
         _cons |  -6.30e-09   .0616405    -0.00   1.000    -.1210397    .1210397
--------------------------------------------------------------------------------

. reg zeffort3 zeffort1 gift turnier feedback creative_trans slider_fair zeffort1Xslid giftXslid turnXslid feedXslid giftXtransfer if (slider==1 | creative==1 | creative_trans==
> 1 | slider_fair==1), robust

Linear regression                               Number of obs     =        659
                                                F(11, 647)        =     118.73
                                                Prob > F          =     0.0000
                                                R-squared         =     0.6192
                                                Root MSE          =     .61976

--------------------------------------------------------------------------------
               |               Robust
      zeffort3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
      zeffort1 |   .6580297   .0352154    18.69   0.000     .5888795    .7271799
          gift |   .0297399   .0865992     0.34   0.731    -.1403096    .1997893
       turnier |   .3499474   .1006184     3.48   0.001     .1523694    .5475255
      feedback |   .0774304   .0899008     0.86   0.389    -.0991022    .2539631
creative_trans |   .0797872   .1016637     0.78   0.433    -.1198435     .279418
   slider_fair |   .2527016   .1185781     2.13   0.033     .0198572     .485546
 zeffort1Xslid |   .2757596   .0527711     5.23   0.000     .1721364    .3793828
     giftXslid |   .2305632   .0949476     2.43   0.015     .0441205    .4170058
     turnXslid |  -.1246179   .1312254    -0.95   0.343    -.3822971    .1330613
     feedXslid |   .0117446   .1119472     0.10   0.916    -.2080791    .2315683
 giftXtransfer |   .2248842   .1027385     2.19   0.029     .0231429    .4266254
         _cons |  -9.21e-10   .0588054    -0.00   1.000    -.1154725    .1154725
--------------------------------------------------------------------------------

. 
. reg zscore2 zscore1 gift turnier feedback creative_trans slider_fair zscore1Xslid giftXslid turnXslid feedXslid giftXtransfer if (slider==1 | creative==1 | creative_trans==1 |
>  slider_fair==1), robust

Linear regression                               Number of obs     =        659
                                                F(11, 647)        =      83.58
                                                Prob > F          =     0.0000
                                                R-squared         =     0.5530
                                                Root MSE          =     .65043

--------------------------------------------------------------------------------
               |               Robust
       zscore2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
       zscore1 |   .6478071   .0423351    15.30   0.000     .5646763    .7309378
          gift |   .0253109   .0978683     0.26   0.796     -.166867    .2174888
       turnier |   .7371745   .1414706     5.21   0.000     .4593776    1.014972
      feedback |   .1765372   .0935381     1.89   0.060    -.0071376    .3602121
creative_trans |   .1226554   .0989473     1.24   0.216    -.0716412     .316952
   slider_fair |   .2517327   .1075134     2.34   0.020     .0406155      .46285
  zscore1Xslid |   .0796306   .0636903     1.25   0.212     -.045434    .2046951
     giftXslid |   .1977103   .1064517     1.86   0.064    -.0113222    .4067428
     turnXslid |  -.0875281   .1659792    -0.53   0.598     -.413451    .2383949
     feedXslid |  -.0118343   .1064106    -0.11   0.911    -.2207862    .1971176
 giftXtransfer |  -.0363361   .0970635    -0.37   0.708    -.2269336    .1542614
         _cons |  -6.33e-09   .0616248    -0.00   1.000    -.1210087    .1210087
--------------------------------------------------------------------------------

. reg zscore3 zscore1 gift turnier feedback creative_trans slider_fair zscore1Xslid giftXslid turnXslid feedXslid giftXtransfer if (slider==1 | creative==1 | creative_trans==1 |
>  slider_fair==1), robust

Linear regression                               Number of obs     =        659
                                                F(11, 647)        =     117.00
                                                Prob > F          =     0.0000
                                                R-squared         =     0.6191
                                                Root MSE          =     .61208

--------------------------------------------------------------------------------
               |               Robust
       zscore3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
       zscore1 |   .6577009   .0352035    18.68   0.000     .5885739    .7268279
          gift |   .0297173   .0865815     0.34   0.732    -.1402974    .1997319
       turnier |   .3499769   .1006345     3.48   0.001     .1523671    .5475866
      feedback |   .0774621   .0899045     0.86   0.389    -.0990778     .254002
creative_trans |   .0449334   .1004695     0.45   0.655    -.1523522    .2422191
   slider_fair |   .2527378   .1186034     2.13   0.033     .0198437    .4856318
  zscore1Xslid |   .2760884   .0527632     5.23   0.000     .1724807    .3796962
     giftXslid |   .2305858   .0949382     2.43   0.015     .0441616    .4170099
     turnXslid |  -.1246473   .1312299    -0.95   0.343    -.3823353    .1330407
     feedXslid |    .011713   .1119403     0.10   0.917    -.2080972    .2315231
 giftXtransfer |   .0866947   .0960023     0.90   0.367     -.101819    .2752083
         _cons |  -9.19e-10   .0588069    -0.00   1.000    -.1154754    .1154754
--------------------------------------------------------------------------------

. 
. reg ztransfer2 ztransfer1 gift turnier feedback creative_trans slider_fair ztransfer1Xslid giftXslid turnXslid feedXslid giftXtransfer if (slider==1 | creative==1 | creative_t
> rans==1 | slider_fair==1), robust

Linear regression                               Number of obs     =        659
                                                F(11, 647)        =      91.60
                                                Prob > F          =     0.0000
                                                R-squared         =     0.5568
                                                Root MSE          =     .67024

---------------------------------------------------------------------------------
                |               Robust
     ztransfer2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
     ztransfer1 |   .6774466   .0413415    16.39   0.000     .5962669    .7586263
           gift |   .0273481   .0978505     0.28   0.780    -.1647947     .219491
        turnier |   .7345186   .1415911     5.19   0.000     .4564851    1.012552
       feedback |   .1736824   .0937672     1.85   0.064    -.0104423    .3578071
 creative_trans |   .0888072   .1023262     0.87   0.386    -.1121244    .2897387
    slider_fair |   .2484741   .1063821     2.34   0.020     .0395783    .4573699
ztransfer1Xslid |   .0499911   .0630342     0.79   0.428    -.0737852    .1737673
      giftXslid |   .1956731   .1064869     1.84   0.067    -.0134285    .4047747
      turnXslid |  -.0848721    .166127    -0.51   0.610    -.4110852     .241341
      feedXslid |  -.0089795   .1066831    -0.08   0.933    -.2184663    .2005074
  giftXtransfer |   .2369228   .1126221     2.10   0.036      .015774    .4580717
          _cons |  -6.55e-09   .0615215    -0.00   1.000    -.1208059    .1208059
---------------------------------------------------------------------------------

. reg ztransfer3 ztransfer1 gift turnier feedback creative_trans slider_fair ztransfer1Xslid giftXslid turnXslid feedXslid giftXtransfer if (slider==1 | creative==1 | creative_t
> rans==1 | slider_fair==1), robust

Linear regression                               Number of obs     =        659
                                                F(11, 647)        =     123.46
                                                Prob > F          =     0.0000
                                                R-squared         =     0.6234
                                                Root MSE          =     .62194

---------------------------------------------------------------------------------
                |               Robust
     ztransfer3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
     ztransfer1 |   .6738337   .0350908    19.20   0.000     .6049281    .7427394
           gift |   .0308261    .086962     0.35   0.723    -.1399357    .2015879
        turnier |   .3485312   .1005686     3.47   0.001      .151051    .5460115
       feedback |   .0759082   .0897669     0.85   0.398    -.1003614    .2521779
 creative_trans |  -.0305529    .098261    -0.31   0.756    -.2235019     .162396
    slider_fair |   .2509641   .1177401     2.13   0.033     .0197654    .4821629
ztransfer1Xslid |   .2599556    .052688     4.93   0.000     .1564954    .3634158
      giftXslid |   .2294769   .0953102     2.41   0.016     .0423221    .4166316
      turnXslid |  -.1232017   .1312209    -0.94   0.348     -.380872    .1344686
      feedXslid |   .0132668   .1118797     0.12   0.906    -.2064243     .232958
  giftXtransfer |   .3073874   .1037474     2.96   0.003      .103665    .5111097
          _cons |  -1.04e-09   .0587437    -0.00   1.000    -.1153514    .1153514
---------------------------------------------------------------------------------

. 
. reg zdiff1 zeffort1 gift turnier feedback creative_trans slider_fair zeffort1Xslid giftXslid turnXslid feedXslid giftXtransfer if (slider==1 | creative==1 | creative_trans==1 
> | slider_fair==1), robust

Linear regression                               Number of obs     =        659
                                                F(11, 647)        =      11.07
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2509
                                                Root MSE          =     .66965

--------------------------------------------------------------------------------
               |               Robust
        zdiff1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
      zeffort1 |  -.3556222   .0444086    -8.01   0.000    -.4428246   -.2684197
          gift |   .0250752   .0978761     0.26   0.798    -.1671181    .2172684
       turnier |   .7374818   .1414507     5.21   0.000     .4597239     1.01524
      feedback |   .1768675   .0935279     1.89   0.059    -.0067873    .3605223
creative_trans |   .1706187   .1046788     1.63   0.104    -.0349325    .3761698
   slider_fair |   .2521097   .1076463     2.34   0.019     .0407314    .4634881
 zeffort1Xslid |   .0830598    .065087     1.28   0.202    -.0447474     .210867
     giftXslid |    .197946   .1064449     1.86   0.063    -.0110731    .4069652
     turnXslid |  -.0878353   .1659604    -0.53   0.597    -.4137214    .2380508
     feedXslid |  -.0121646   .1063993    -0.11   0.909    -.2210942    .1967651
 giftXtransfer |   .0466241   .1136333     0.41   0.682    -.1765105    .2697588
         _cons |  -7.21e-09   .0616405    -0.00   1.000    -.1210397    .1210397
--------------------------------------------------------------------------------

. reg zdiff3 zeffort1 gift turnier feedback creative_trans slider_fair zeffort1Xslid giftXslid turnXslid feedXslid giftXtransfer if (slider==1 | creative==1 | creative_trans==1 
> | slider_fair==1), robust

Linear regression                               Number of obs     =        659
                                                F(11, 647)        =      10.13
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1804
                                                Root MSE          =     .61976

--------------------------------------------------------------------------------
               |               Robust
        zdiff3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
      zeffort1 |  -.3419703   .0352154    -9.71   0.000    -.4111205   -.2728201
          gift |   .0297398   .0865992     0.34   0.731    -.1403096    .1997893
       turnier |   .3499474   .1006184     3.48   0.001     .1523694    .5475255
      feedback |   .0774304   .0899008     0.86   0.389    -.0991022    .2539631
creative_trans |   .0797872   .1016637     0.78   0.433    -.1198435     .279418
   slider_fair |   .2527016   .1185781     2.13   0.033     .0198572     .485546
 zeffort1Xslid |   .2757596   .0527711     5.23   0.000     .1721364    .3793828
     giftXslid |   .2305632   .0949476     2.43   0.015     .0441205    .4170058
     turnXslid |  -.1246179   .1312254    -0.95   0.343     -.382297    .1330613
     feedXslid |   .0117446   .1119472     0.10   0.916    -.2080791    .2315683
 giftXtransfer |   .2248842   .1027385     2.19   0.029     .0231429    .4266254
         _cons |  -5.52e-10   .0588054    -0.00   1.000    -.1154725    .1154725
--------------------------------------------------------------------------------

. 
. 
. 
. ************************************************************************************************
. * Erstellung Dummies Over-/Underpaid
. 
. gen fairwage_overpaid = 0 

. replace fairwage_overpaid = 1 if (fairwage==1 | fairwage==2)
(88 real changes made)

. gen fairwage_underpaid = 0

. replace fairwage_underpaid = 1 if (fairwage==4 | fairwage==5)
(64 real changes made)

. gen fairwage_ok = 0

. replace fairwage_ok = 1 if fairwage==3
(35 real changes made)

. 
. replace fairwage_overpaid =  . if fairwage == .
(573 real changes made, 573 to missing)

. replace fairwage_ok =  . if fairwage == .
(573 real changes made, 573 to missing)

. replace fairwage_underpaid =  . if fairwage == .
(573 real changes made, 573 to missing)

. 
. 
. * Erstellung Interatkionsterme
. 
. gen overpaidXslider_fair = fairwage_overpaid*slider_fair
(573 missing values generated)

. 
. gen underpaidXslider_fair = fairwage_underpaid*slider_fair
(573 missing values generated)

. 
. gen underpaidXgiftXtrans = fairwage_underpaid*giftXtransfer
(573 missing values generated)

. 
. gen overpaidXgiftXtrans = fairwage_overpai*giftXtransfer
(573 missing values generated)

. 
. * Regression Fairwage Slider only
. 
. reg zeffort2 zeffort1 fairwage_overpaid fairwage_underpaid if (slider_fair==1), robust

Linear regression                               Number of obs     =         48
                                                F(3, 44)          =      58.70
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7254
                                                Root MSE          =     .55725

------------------------------------------------------------------------------------
                   |               Robust
          zeffort2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
          zeffort1 |   .8582111   .0681526    12.59   0.000     .7208585    .9955637
 fairwage_overpaid |   .4357851   .1944077     2.24   0.030     .0439821    .8275881
fairwage_underpaid |  -.0223134   .1990978    -0.11   0.911    -.4235686    .3789418
             _cons |   .1107938   .1429627     0.77   0.442    -.1773286    .3989162
------------------------------------------------------------------------------------

. reg zeffort3 zeffort1 fairwage_overpaid fairwage_underpaid if (slider_fair==1), robust

Linear regression                               Number of obs     =         48
                                                F(3, 44)          =      56.17
                                                Prob > F          =     0.0000
                                                R-squared         =     0.6884
                                                Root MSE          =     .67179

------------------------------------------------------------------------------------
                   |               Robust
          zeffort3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
          zeffort1 |   .9444947   .0728371    12.97   0.000     .7977012    1.091288
 fairwage_overpaid |  -.0579497   .2338098    -0.25   0.805    -.5291623     .413263
fairwage_underpaid |  -.0918681   .2080604    -0.44   0.661    -.5111862    .3274501
             _cons |   .2763876   .1275872     2.17   0.036     .0192526    .5335227
------------------------------------------------------------------------------------

. 
. * Regression Fairwage Creative only
. 
. reg zeffort2 zeffort1 giftXtrans fairwage_overpaid fairwage_underpaid overpaidXgiftXtrans underpaidXgiftXtrans if (creative_trans==1), robust

Linear regression                               Number of obs     =        139
                                                F(6, 132)         =      12.06
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4391
                                                Root MSE          =     .67444

--------------------------------------------------------------------------------------
                     |               Robust
            zeffort2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
            zeffort1 |   .5994483   .0814293     7.36   0.000     .4383731    .7605236
       giftXtransfer |  -.1353189   .2386336    -0.57   0.572    -.6073598     .336722
   fairwage_overpaid |  -.2040995   .2273405    -0.90   0.371    -.6538014    .2456024
  fairwage_underpaid |  -.1857524   .2619529    -0.71   0.480    -.7039211    .3324163
 overpaidXgiftXtrans |   .1614669   .2788059     0.58   0.563    -.3900387    .7129725
underpaidXgiftXtrans |   .3748799   .3352723     1.12   0.266    -.2883219    1.038082
               _cons |   .3507584   .2049907     1.71   0.089    -.0547335    .7562502
--------------------------------------------------------------------------------------

. reg zeffort3 zeffort1 giftXtrans fairwage_overpaid fairwage_underpaid overpaidXgiftXtrans underpaidXgiftXtrans if (creative_trans==1), robust

Linear regression                               Number of obs     =        139
                                                F(6, 132)         =      23.07
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4782
                                                Root MSE          =      .6004

--------------------------------------------------------------------------------------
                     |               Robust
            zeffort3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
            zeffort1 |   .5507703   .0556158     9.90   0.000     .4407567    .6607838
       giftXtransfer |  -.1384214    .273793    -0.51   0.614     -.680011    .4031682
   fairwage_overpaid |  -.3014909   .2654748    -1.14   0.258    -.8266263    .2236446
  fairwage_underpaid |  -.0936927     .26933    -0.35   0.728    -.6264541    .4390688
 overpaidXgiftXtrans |   .5175737   .3110626     1.66   0.099    -.0977389    1.132886
underpaidXgiftXtrans |   .3508868   .3267158     1.07   0.285    -.2953894     .997163
               _cons |   .2881824   .2485724     1.16   0.248    -.2035183    .7798831
--------------------------------------------------------------------------------------

. 
. reg ztransfer2 ztransfer1 giftXtrans fairwage_overpaid fairwage_underpaid overpaidXgiftXtrans underpaidXgiftXtrans if (creative_trans==1), robust

Linear regression                               Number of obs     =        139
                                                F(6, 132)         =      24.15
                                                Prob > F          =     0.0000
                                                R-squared         =     0.5239
                                                Root MSE          =      .6797

--------------------------------------------------------------------------------------
                     |               Robust
          ztransfer2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
          ztransfer1 |   .6927917   .0662699    10.45   0.000     .5617033    .8238802
       giftXtransfer |   .0275895   .2125903     0.13   0.897    -.3929352    .4481142
   fairwage_overpaid |  -.2306873   .1838119    -1.26   0.212    -.5942854    .1329108
  fairwage_underpaid |  -.0688867    .222999    -0.31   0.758    -.5100007    .3722274
 overpaidXgiftXtrans |    .272364   .2549417     1.07   0.287    -.2319358    .7766638
underpaidXgiftXtrans |   .3053421   .3237626     0.94   0.347    -.3350923    .9457764
               _cons |   .2190098   .1571272     1.39   0.166    -.0918033    .5298229
--------------------------------------------------------------------------------------

. reg ztransfer3 ztransfer1 giftXtrans fairwage_overpaid fairwage_underpaid overpaidXgiftXtrans underpaidXgiftXtrans if (creative_trans==1), robust

Linear regression                               Number of obs     =        139
                                                F(6, 132)         =      27.94
                                                Prob > F          =     0.0000
                                                R-squared         =     0.5143
                                                Root MSE          =     .61667

--------------------------------------------------------------------------------------
                     |               Robust
          ztransfer3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
          ztransfer1 |   .5983865   .0567277    10.55   0.000     .4861735    .7105995
       giftXtransfer |   .0549655   .2054614     0.27   0.789    -.3514574    .4613884
   fairwage_overpaid |  -.2040306   .1965863    -1.04   0.301    -.5928977    .1848365
  fairwage_underpaid |   .0857672   .2043198     0.42   0.675    -.3183976     .489932
 overpaidXgiftXtrans |   .4423755   .2541618     1.74   0.084    -.0603818    .9451327
underpaidXgiftXtrans |   .0477898    .273013     0.18   0.861     -.492257    .5878365
               _cons |   .0321813   .1604381     0.20   0.841    -.2851811    .3495437
--------------------------------------------------------------------------------------

. 
. *************************************************************************************************
. * Location Dummy
. gen heidelberg = 1 if mannheim==2
(708 missing values generated)

. replace heidelberg = 0 if heidelberg== .
(708 real changes made)

. replace mannheim = 0 if heidelberg==1
(52 real changes made)

. ********************************************
. 
. merge 1:1 id using "$mypath\raw_data\originality_cutoffs.dta", nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                           124
        from master                       124  
        from using                          0  

    matched                               636  
    -----------------------------------------

. 
. save "$mypath\Overview_Aufbereitet.dta", replace
file C:\Users\gtierney\Google Drive\final version April 2018\data\Overview_Aufbereitet.dta saved

. 
. log close
      name:  <unnamed>
       log:  C:\Users\gtierney\Google Drive\final version April 2018\data\Overview_Aufbereitet.log
  log type:  text
 closed on:  17 Apr 2018, 13:55:52
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
