---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\gtierney\Google Drive\final version April 2018\data\Tables\Logs\TableCreativeTransfer.log
  log type:  text
 opened on:  17 Apr 2018, 11:42:12

. drop if treatment == 4
(124 observations deleted)

. 
. foreach i in 1 2 3{
  2.         sum transfer`i' if treatment_id == 41
  3.         gen std_transfer`i' = (transfer`i' - `r(mean)')/`r(sd)'
  4. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   transfer1 |         71    17.49859    11.85647          0         40

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   transfer2 |         71    17.46479    12.88169          0         55

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   transfer3 |         71    15.84789    11.02918          0         44

. 
. eststo clear

. 
. eststo: reg std_transfer2 gift_transfer std_transfer1 if creative_trans == 1, robust

Linear regression                               Number of obs     =        139
                                                F(2, 136)         =      69.05
                                                Prob > F          =     0.0000
                                                R-squared         =     0.5151
                                                Root MSE          =     .63378

-------------------------------------------------------------------------------
              |               Robust
std_transfer2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
gift_transfer |   .2238992   .1027406     2.18   0.031     .0207234    .4270751
std_transfer1 |   .6526518   .0632435    10.32   0.000     .5275839    .7777197
        _cons |   1.95e-09   .0770335     0.00   1.000    -.1523383    .1523383
-------------------------------------------------------------------------------
(est1 stored)

. eststo: reg std_transfer2 gift_transfer std_transfer1 $controls if creative_trans == 1, robust
note: pruefungszeit omitted because of collinearity

Linear regression                               Number of obs     =        139
                                                F(11, 127)        =      16.40
                                                Prob > F          =     0.0000
                                                R-squared         =     0.5395
                                                Root MSE          =     .63913

-------------------------------------------------------------------------------
              |               Robust
std_transfer2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
gift_transfer |   .2645928   .1256457     2.11   0.037     .0159626    .5132229
std_transfer1 |   .6532471    .061617    10.60   0.000     .5313182     .775176
          age |   .0400963   .0496871     0.81   0.421    -.0582254     .138418
         age2 |  -.0005821   .0006542    -0.89   0.375    -.0018765    .0007124
          sex |   .1783737   .1170554     1.52   0.130    -.0532579    .4100053
   ferienzeit |   -.076429   .1993169    -0.38   0.702    -.4708411    .3179831
pruefungszeit |          0  (omitted)
         wiwi |   -.010905   .1497228    -0.07   0.942    -.3071795    .2853694
        recht |   -.079665   .2161215    -0.37   0.713    -.5073304    .3480004
         nawi |  -.1687604   .1718859    -0.98   0.328    -.5088915    .1713707
         gewi |   .2422947   .2320423     1.04   0.298     -.216875    .7014645
     mannheim |   .0674292   .1381682     0.49   0.626    -.2059808    .3408392
        _cons |  -.6738816   .8509765    -0.79   0.430    -2.357811    1.010047
-------------------------------------------------------------------------------
(est2 stored)

. 
. #delimit; // #delimit: command resets the character that marks the end of a command, here ;
delimiter now ;
. esttab using "$mypath\Tables\Output\Table5_DiscretionaryTransfer_Effects.tex", 
>         nomtitles       
>         label      
>         varlabel (_cons "Constant" std_transfer1 "Period 1 Transfer" gift_transfer "Gift" )
>         starlevels(* .10 ** 0.05 *** .01)                                                                                                               
>         stats(N r2, fmt(%9.0f %9.3f) labels("Observations"  "\$R^2$"))  // stats (specify statistics to be displayed for each model in the table footer), fmt() (
>         b(%9.3f)
>         se(%9.3f)
>     drop ($controls)
>         fragment
>         style(tex) 
>         substitute(\_ _)
>         nonumbers 
>         prehead(
>         "\begin{table}[h]%" 
>         "\setlength\tabcolsep{6pt}"
>         "\caption{Creative Task with Discretionary Transfers}"
>         
>         "\begin{center}%" 
>         "{\small\renewcommand{\arraystretch}{1.2}%" 
>         "\begin{tabular}{lcc}" 
>         "\hline\noalign{\smallskip}"
>         " & \multicolumn{2}{c}{\bf Amount Transferred} \\"
>         " & I & II \\")
>         posthead("\hline\noalign{\smallskip}") 
>         prefoot("\hline"
>         " Additional Controls & NO & YES \\"
>         "\hline" ) 
>         postfoot("\hline\noalign{\medskip}"
>         "\end{tabular}"
>         "\begin{minipage}{\textwidth} $footnote_params"
>         "\footnotesize NOTE.--This table reports the results from the supplementary \textit{Creative Task with Discretionary Transfers} treatments. "
>         "$ctdt_description "
>         "$ctdt_contrast "
>         "$ctdt_regression " 
>         "$ctdt_gift_coef_description "
>         ""
>         "$ctdt_sample "
>         "$controls_list "
>         "$errors_stars "
>         ""
>         "$p1"
>         ""
>         "$p2"
>         ""
>         "$p3"
>         "\end{minipage}}"
>         "\end{center}"
>         "\label{tab:Discretionary}"
>         "\end{table}")
>         replace;
(note: file C:\Users\gtierney\Google Drive\final version April 2018\data\Tables\Output\Table5_DiscretionaryTransfer_Effects.tex not found)
(output written to C:\Users\gtierney\Google Drive\final version April 2018\data\Tables\Output\Table5_DiscretionaryTransfer_Effects.tex)

.                         #delimit cr     // #delimit cr: restore the carriage return delimiter inside a file

end of do-file

. clear all

. set more off

. set memory 100m
set memory ignored.
    Memory no longer needs to be set in modern Statas; memory adjustments are performed on the fly automatically.

. cap log close
