-------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Dropbox\Work\Projekte\Aktiv\WOEK\Do-Files\Stata\Figures\Figure 2\Figure2&3_paired.log
  log type:  text
 opened on:   2 Dec 2015, 18:11:29

. 
. 
. * Regressions for Figure 2 *
. 
. ttest effort2==effort1 if treatment_id==11, level(90)

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [90% Conf. Interval]
---------+--------------------------------------------------------------------
 effort2 |      60    19.78333    1.668941    12.92756    16.99438    22.57229
 effort1 |      60    16.58333    1.614603    12.50666    13.88518    19.28149
---------+--------------------------------------------------------------------
    diff |      60         3.2      1.0819    8.380364    1.392044    5.007956
------------------------------------------------------------------------------
     mean(diff) = mean(effort2 - effort1)                         t =   2.9578
 Ho: mean(diff) = 0                              degrees of freedom =       59

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.9978         Pr(|T| > |t|) = 0.0045          Pr(T > t) = 0.0022

. ttest effort2==effort1 if treatment_id==12, level(90) 

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [90% Conf. Interval]
---------+--------------------------------------------------------------------
 effort2 |      60    24.38333    1.685614    13.05671    21.56652    27.20015
 effort1 |      60    18.86667    1.821167     14.1067    15.82333    21.91001
---------+--------------------------------------------------------------------
    diff |      60    5.516667     1.00155    7.757974    3.842983     7.19035
------------------------------------------------------------------------------
     mean(diff) = mean(effort2 - effort1)                         t =   5.5081
 Ho: mean(diff) = 0                              degrees of freedom =       59

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest effort2==effort1 if treatment_id==13, level(90) 

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [90% Conf. Interval]
---------+--------------------------------------------------------------------
 effort2 |      56    32.21429    1.320103    9.878745    30.00571    34.42286
 effort1 |      56    21.94643    1.710058     12.7969    19.08544    24.80741
---------+--------------------------------------------------------------------
    diff |      56    10.26786    1.473685    11.02805    7.802332    12.73338
------------------------------------------------------------------------------
     mean(diff) = mean(effort2 - effort1)                         t =   6.9675
 Ho: mean(diff) = 0                              degrees of freedom =       55

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. *ttest effort2==effort1 if treatment_id==14, level(90) 
. 
. ttest effort2==effort1 if treatment_id==21, level(90) 

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [90% Conf. Interval]
---------+--------------------------------------------------------------------
 effort2 |      56    15.89286    1.614399    12.08106    13.19191     18.5938
 effort1 |      56    16.78571    1.562282    11.69104    14.17196    19.39946
---------+--------------------------------------------------------------------
    diff |      56   -.8928571    1.201914    8.994298     -2.9037    1.117985
------------------------------------------------------------------------------
     mean(diff) = mean(effort2 - effort1)                         t =  -0.7429
 Ho: mean(diff) = 0                              degrees of freedom =       55

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.2304         Pr(|T| > |t|) = 0.4607          Pr(T > t) = 0.7696

. ttest effort2==effort1 if treatment_id==22, level(90) 

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [90% Conf. Interval]
---------+--------------------------------------------------------------------
 effort2 |      56    15.66071    1.323925    9.907347    13.44574    17.87569
 effort1 |      56    15.98214    1.430305    10.70343    13.58919    18.37509
---------+--------------------------------------------------------------------
    diff |      56   -.3214286    1.028524    7.696769   -2.042184    1.399327
------------------------------------------------------------------------------
     mean(diff) = mean(effort2 - effort1)                         t =  -0.3125
 Ho: mean(diff) = 0                              degrees of freedom =       55

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.3779         Pr(|T| > |t|) = 0.7558          Pr(T > t) = 0.6221

. ttest effort2==effort1 if treatment_id==23, level(90) 

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [90% Conf. Interval]
---------+--------------------------------------------------------------------
 effort2 |      60        25.5    1.763327    13.65867    22.55332    28.44668
 effort1 |      60    17.83333    1.406234    10.89265    15.48338    20.18328
---------+--------------------------------------------------------------------
    diff |      60    7.666667    1.617117    12.52613    4.964314    10.36902
------------------------------------------------------------------------------
     mean(diff) = mean(effort2 - effort1)                         t =   4.7409
 Ho: mean(diff) = 0                              degrees of freedom =       59

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. *ttest effort2==effort1 if treatment_id==24, level(90) 
. 
. 
. * Regressions for Figure 3 *
. 
. ttest effort3==effort1 if treatment_id==11, level(90) 

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [90% Conf. Interval]
---------+--------------------------------------------------------------------
 effort3 |      60        17.1    1.648266    12.76741    14.34559    19.85441
 effort1 |      60    16.58333    1.614603    12.50666    13.88518    19.28149
---------+--------------------------------------------------------------------
    diff |      60    .5166667    .9535813    7.386409   -1.076856     2.11019
------------------------------------------------------------------------------
     mean(diff) = mean(effort3 - effort1)                         t =   0.5418
 Ho: mean(diff) = 0                              degrees of freedom =       59

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.7050         Pr(|T| > |t|) = 0.5900          Pr(T > t) = 0.2950

. ttest effort3==effort1 if treatment_id==12, level(90) 

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [90% Conf. Interval]
---------+--------------------------------------------------------------------
 effort3 |      60        22.6    1.920481    14.87598     19.3907     25.8093
 effort1 |      60    18.86667    1.821167     14.1067    15.82333    21.91001
---------+--------------------------------------------------------------------
    diff |      60    3.733333    .8778076    6.799468    2.266435    5.200231
------------------------------------------------------------------------------
     mean(diff) = mean(effort3 - effort1)                         t =   4.2530
 Ho: mean(diff) = 0                              degrees of freedom =       59

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0001          Pr(T > t) = 0.0000

. ttest effort3==effort1 if treatment_id==13, level(90) 

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [90% Conf. Interval]
---------+--------------------------------------------------------------------
 effort3 |      56    25.08929    2.079004    15.55784    21.61104    28.56753
 effort1 |      56    21.94643    1.710058     12.7969    19.08544    24.80741
---------+--------------------------------------------------------------------
    diff |      56    3.142857    1.259104    9.422273    1.036333    5.249381
------------------------------------------------------------------------------
     mean(diff) = mean(effort3 - effort1)                         t =   2.4961
 Ho: mean(diff) = 0                              degrees of freedom =       55

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.9922         Pr(|T| > |t|) = 0.0156          Pr(T > t) = 0.0078

. *ttest effort3==effort1 if treatment_id==14, level(90) 
. 
. ttest effort3==effort1 if treatment_id==21, level(90) 

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [90% Conf. Interval]
---------+--------------------------------------------------------------------
 effort3 |      56    15.71429    1.694666    12.68172    12.87905    18.54952
 effort1 |      56    16.78571    1.562282    11.69104    14.17196    19.39946
---------+--------------------------------------------------------------------
    diff |      56   -1.071429    1.222584    9.148983   -3.116854    .9739965
------------------------------------------------------------------------------
     mean(diff) = mean(effort3 - effort1)                         t =  -0.8764
 Ho: mean(diff) = 0                              degrees of freedom =       55

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.1923         Pr(|T| > |t|) = 0.3846          Pr(T > t) = 0.8077

. ttest effort3==effort1 if treatment_id==22, level(90) 

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [90% Conf. Interval]
---------+--------------------------------------------------------------------
 effort3 |      56    15.51786    1.127862    8.440144    13.63091    17.40481
 effort1 |      56    15.98214    1.430305    10.70343    13.58919    18.37509
---------+--------------------------------------------------------------------
    diff |      56   -.4642857    .9986888    7.473503   -2.135126    1.206555
------------------------------------------------------------------------------
     mean(diff) = mean(effort3 - effort1)                         t =  -0.4649
 Ho: mean(diff) = 0                              degrees of freedom =       55

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.3219         Pr(|T| > |t|) = 0.6438          Pr(T > t) = 0.6781

. ttest effort3==effort1 if treatment_id==23, level(90) 

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [90% Conf. Interval]
---------+--------------------------------------------------------------------
 effort3 |      60        20.9    1.445371    11.19579    18.48465    23.31535
 effort1 |      60    17.83333    1.406234    10.89265    15.48338    20.18328
---------+--------------------------------------------------------------------
    diff |      60    3.066667    1.097729    8.502974    1.232259    4.901074
------------------------------------------------------------------------------
     mean(diff) = mean(effort3 - effort1)                         t =   2.7936
 Ho: mean(diff) = 0                              degrees of freedom =       59

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.9965         Pr(|T| > |t|) = 0.0070          Pr(T > t) = 0.0035

. *ttest effort3==effort1 if treatment_id==24, level(90)                                                                                         
>                                  
. 
. 
. log close
      name:  <unnamed>
       log:  D:\Dropbox\Work\Projekte\Aktiv\WOEK\Do-Files\Stata\Figures\Figure 2\Figure2&3_paired.log
  log type:  text
 closed on:   2 Dec 2015, 18:11:29
-------------------------------------------------------------------------------------------------------------------------------------------------
